var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "曾祥龙",
    sex: "男",
    age: "22",
    phone: "15779774900",
    email: "cengxianglong00@gmail.com",
    address: "现居河南省郑州市金水区",
    qq: "1970084760",
    log: "老狗的个人主页",
    excpect_work: "Python/Java后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "If the old dog.",
        "只有自律的人才能获得真正的自由。如果你不自律,那你只能沦为个人情绪的奴隶。",
        "Go For It!",
        "人类没有极限,我不知道极限在哪里,但我想去那里。",
        "时刻要提醒自己，耐心、忍耐、勤勉、希望、信仰、自律。",
        "真相，是为了剿灭幻想。",
        "矛盾是无处不在的。",
        "长风破浪会有时，直挂云帆济沧海。",
        "预则立，不预则废。",
        "Nothing is impossible.",
        "我自横刀向天笑，去留肝胆两昆仑。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "日月之行，若出其中<br>" +
             "星汉灿烂，若出其里<br>" +
             "你好，我是曾祥龙，华北水利水电大学软件工程大四在读生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫曾祥龙，性别男，华北水利水电大学软件工程大四在读。我期望的工作岗位是Python/Java后端开发。</p>" +
        "<p>我有着较多的Java编程和Python开发经验，计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，目前能够接受加班或出差等安排</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Java", 80, "red"],
        ["Pyhton", 77, "blue"],
        ["SQL", 75, "#1abc9c"],
        ["HTML5", 67, "rgba(0,0,0)"],
        ["CSS3", 60, "yellow"],
        ["JavaScript", 70, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>数据结构、操作系统、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟练掌握Java基础。</li>" +
        "     <li>熟悉JavaIO、多线程、集合等基础框架。</li>" +
        "     <li>了解JVM原理。</li>" +
        "     <li>熟悉Pyhton语言开发基本知识。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉基本Linux命令操作。</li>" +
        "     <li>熟悉Spring、ibatis、struts等框架的使用，了解其原理与机制。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>了解分布式系统的设计与应用。</li>" +
        "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "https://github.com/LGwhy/NCWUHelp", "校园互助平台", "使用SSM框架编写的校园互助平台Java web程序<br>2022/06/10"],
        ["./images/pro-3.png", "https://github.com/LGwhy/Class-AI", "在线课堂舆情检测训练", "使用python语言结合人工智能算法编写的课堂舆情检测系统<br>2022/06/24"],
        ["./images/pro-2.png", "https://github.com/LGwhy/Five_Chess", "智能人机/人人对战五子棋", "使用Java语言编写的智能五子棋人机/人人对战<br>2021/10/19"],
        ["./images/pro-4.png", "https://github.com/LGwhy/Ncwu_PM", "物业管理系统", "使用MVC框架编写的物业管理系统<br>2022/05/29"],
        ["./images/pro-5.png", "https://github.com/LGwhy/DB_Library", "图书管理系统", "基于MySQL数据库，采用Python编写的图书管理系统<br>2021/12/30"],
        ["./images/pro-6.png", "https://github.com/happysnaker/Gobang", "校庆网页设计", "使用脚本语言设计“校庆70周年”主题网页<br>2021/12/26"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2018/9/1 — 2020/9/1", "<br>服役",
            "<p><strong>中国人民解放军火箭军</strong></p>" +
            "<p>18年通过体检，参军入伍，服役于中国人民解放军火箭军，遂有外号老狗；于20年9月退出现役，现在已经是一名光荣的退役大学生士兵。</p>" +
            "<p>多的不予讨论，但经过两年的洗礼，我具备强烈的团队意识与社会责任感，拥有独立解决问题的能力，稳如老狗是我的一贯作风，突破极限是我的一生追求。</p>"
        ],

        ["2020/9/1 — 2022/11/10", "<br>在读",
            "<p><strong>华北水利水电大学</strong></p>" +
            "<p>退役后，返回原校就读，毅然转专业选择了软件工程；经过自己的努力与奋斗，从不具备编程思想转变成已经具备初步开发思想，高标准完成项目任务，GPA在专业前10%。</p>" +
            "<p>在生活中，积极参与各项文体活动；跟随教练出征河南省大学生运动会，代表学院参加校运动会，参与各项志愿者活动，充分发挥个人奉献精神；生活不易，心理和生理应全面发展。</p>"
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2022-09-22", "2021-2022学年国家励志奖学金", "大三整个学年，延续大二拼搏自我的精神，努力学习专业知识，以GPA第11/215位次获得国家励志奖学金。"],
        ["2021-05-11", "河南省大学生第二十一届田径运动会团体第七", "代表学校出战，获得本科甲组男子团体总分第七名。"],
        ["2018-05-05", "晋冀鲁豫四省田径邀请赛男子甲组800米第七名", "远古时期，大一时候，代表学校参加由四省联合举办的田径邀请赛，以2分13秒51获得男子甲组800米第七名。"],
        ["2021-11-13", "华北水利水电大学学业奖学金及优秀学生奖学金", "大二学年，虽然很努力，但迫于刚回学校落后了太多知识，仅获得三等学业奖学金及三等优秀学生奖学金。"],
        ["2021-04-23", "华北水利水电大学2021春季田径运动会男子800米第三", "代表学院参加校运会，以2分16秒的好成绩获得男子800米第三名。"],
        ["2018-03-25", "2018郑开国际马拉松赛“优秀志愿者”", "远古时期，尚未存在疫情，为来自世界各地参赛的选手提供后勤服务，担任志愿小组组长，获得“优秀志愿者”证书。"]

    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/tg.svg", "https://telegram.me/Kip159", "我的TG"],
        ["./svg/local.svg", "https://www.google.com/maps?q=Zhengzhou", "我的Local"],
        ["./svg/github.svg", "https://github.com/LGwhy", "我的GitHub主页"],
        ["./svg/v2ex.svg", "https://www.v2ex.com/member/laogou2000", "我的V2ex"],
        ["./svg/QQ.svg", "tencent://message/?Menu=yes&uin=1970084760&Service=300&sigT=45a1e5847943b64c6ff3990f8a9e644d2b31356cb0b4ac6b24663a3c8dd0f8aa12a595b1714f9d45", "我的QQ"]
    ],


    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}